#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
int main()
{
	//1.	隐式类型转换
	/*char c = -1;*/
	//-1 10000000000000000000000000000001
	//补 11111111111111111111111111111111
	//11111111整型提升,32位截8位，截断

	char a = 5;
	//00000101
	//01111110
	//发生整形提升
	//00000000000000000000000000000101
	//00000000000000000000000001111110
	//00000000000000000000000010000011
	//10000011——c
	//相加前要整型提升，相加后要再次截断，剩8位给到c
	char b = 126;
	char c = a + b;
	printf("%d", c);//要打印整形，需要整型提升
	//11111111111111111111111110000011——补码
	//10000000000000000000000001111101原 -125
	system("pause");
	return 0;
}